## sso_proxy
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 2 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.pomerium_sso_proxy will be updated in-place
  ~ resource "aws_ecs_service" "pomerium_sso_proxy" {
        id                                 = "arn:aws:ecs:ca-central-1:794722365809:service/pomerium_sso_proxy/pomerium_sso_proxy"
        name                               = "pomerium_sso_proxy"
        tags                               = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-sso-proxy"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:794722365809:task-definition/pomerium_sso_proxy:14" -> (known after apply)
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.pomerium_sso_proxy must be replaced
-/+ resource "aws_ecs_task_definition" "pomerium_sso_proxy" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:794722365809:task-definition/pomerium_sso_proxy:14" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  ~ environment      = [
                        # (5 unchanged elements hidden)
                        {
                            name  = "LOG_LEVEL"
                            value = "debug"
                        },
                      ~ {
                            name  = "ROUTES"
                          ~ value = "LSBmcm9tOiBodHRwczovL2F1dGguc2VjdXJpdHkuY2Rzc2FuZGJveC54eXoKICB0bzogaHR0cDovL2F1dGguNzk0NzIyMzY1ODA5LmxvY2FsOjgwMDAKICBwb2xpY3k6CiAgICAtIGFsbG93OgogICAgICAgIG9yOgogICAgICAgICAgLSBkb21haW46CiAgICAgICAgICAgICAgaXM6IHNlY3VyaXR5LmNkc3NhbmRib3gueHl6CiAgY29yc19hbGxvd19wcmVmbGlnaHQ6IHRydWUKICB0aW1lb3V0OiAzMHMKCi0gZnJvbTogaHR0cHM6Ly9uZW80ai5zZWN1cml0eS5jZHNzYW5kYm94Lnh5egogIHRvOiBodHRwczovL2NhcnRvZ3JhcGh5LTdiNWRkYWMyODUwNTJmNDQuZWxiLmNhLWNlbnRyYWwtMS5hbWF6b25hd3MuY29tOjc0NzQKICBwb2xpY3k6CiAgICAgIC0gYWxsb3c6CiAgICAgICAgICBvcjoKICAgICAgICAgICAgLSBkb21haW46CiAgICAgICAgICAgICAgICBpczogY2RzLXNuYy5jYQo=" -> "LSBmcm9tOiBodHRwczovL2F1dGguc2VjdXJpdHkuY2Rzc2FuZGJveC54eXoKICB0bzogaHR0cDovL2F1dGguNzk0NzIyMzY1ODA5LmxvY2FsOjgwMDAKICBwb2xpY3k6CiAgICAtIGFsbG93OgogICAgICAgIG9yOgogICAgICAgICAgLSBkb21haW46CiAgICAgICAgICAgICAgaXM6IHNlY3VyaXR5LmNkc3NhbmRib3gueHl6CiAgY29yc19hbGxvd19wcmVmbGlnaHQ6IHRydWUKICB0aW1lb3V0OiAzMHMKCi0gZnJvbTogaHR0cHM6Ly9uZW80ai5zZWN1cml0eS5jZHNzYW5kYm94Lnh5egogIHRvOiBodHRwOi8vY2FydG9ncmFwaHktN2I1ZGRhYzI4NTA1MmY0NC5lbGIuY2EtY2VudHJhbC0xLmFtYXpvbmF3cy5jb206NzQ3NC8KICBwcmVzZXJ2ZV9ob3N0X2hlYWRlcjogdHJ1ZQogIHBvbGljeToKICAgICAgLSBhbGxvdzoKICAgICAgICAgIG9yOgogICAgICAgICAgICAtIGRvbWFpbjoKICAgICAgICAgICAgICAgIGlzOiBjZHMtc25jLmNhCgotIGZyb206IGh0dHBzOi8vYm9sdC5uZW80ai5zZWN1cml0eS5jZHNzYW5kYm94Lnh5egogIHRvOiBodHRwOi8vY2FydG9ncmFwaHktN2I1ZGRhYzI4NTA1MmY0NC5lbGIuY2EtY2VudHJhbC0xLmFtYXpvbmF3cy5jb206NzY4Ny8KICBwcmVzZXJ2ZV9ob3N0X2hlYWRlcjogdHJ1ZQogIHBvbGljeToKICAgICAgLSBhbGxvdzoKICAgICAgICAgIG9yOgogICAgICAgICAgICAtIGRvbWFpbjoKICAgICAgICAgICAgICAgIGlzOiBjZHMtc25jLmNh"
                        },
                    ]
                  - mountPoints      = [] -> null
                    name             = "pomerium_sso_proxy"
                  - volumesFrom      = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "pomerium_sso_proxy" -> (known after apply)
      ~ revision                 = 14 -> (known after apply)
        tags                     = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-sso-proxy"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_security_group.pomerium will be updated in-place
  ~ resource "aws_security_group" "pomerium" {
      ~ egress                 = [
          + {
              + cidr_blocks      = [
                  + "10.0.8.0/22",
                ]
              + description      = "Access Cartography cidr"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 65535
            },
            # (2 unchanged elements hidden)
        ]
        id                     = "sg-00ab298fa807e1a6b"
        name                   = "pomerium"
        tags                   = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-sso-proxy"
            "Terraform"  = "true"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
